  1 " включить подсветку синтаксиса
  2 syntax enable
  3 " показывать номера строк
  4 set number
  5 " установить tab равным 4 пробелам
  6 set ts=4
  7 " отступ при переходе на следующую строку при написании кода
  8 set autoindent
  9 " преобразование tab-ов в пробелы
 10 set expandtab
 11 " при использовании команд >> или << сдвигать строки на 4 пробела
 12 set shiftwidth=4
 13 " выделять строку, на которой находится курсор
 14 set cursorline
 15 " показывать парную скобку для [] {} и ()
 16 set showmatch
 17 " включить подсветку синтаксиса Python
 18 let python_highlight_all = 1
 19
 20 imap <F5> <Esc>:w<CR>:!clear;python3 %<CR>
